Repository: cyberwillis/project-avenue
Catalog: AvenueEntrega.I18N/Resources.*.resx
Languages: pt

# CadastrarMapaViewModel_AttributeName_File
source: Filename
pt: Arquivo de carga

# CadastrarMapaViewModel_AttributeName_NomeMapa
source: Map name
pt: Nome do mapa

# CalculoCustoViewModel_AttributeName_Autonomia
source: Vehicle autonomy (0.00)
pt: Autonomia do veículo (0,00)

# CalculoCustoViewModel_AttributeName_Destino
source: Destination
pt: Destino

# CalculoCustoViewModel_AttributeName_NomeMapa
source: Map name
pt: Nome do mapa

# CalculoCustoViewModel_AttributeName_Origem
source: Origin
pt: Origem

# CalculoCustoViewModel_AttributeName_ValorCombustivel
source: Fuel cost (0.00)
pt: Valor do combustível (0.00)

# MapaController_HttpGet_Action_Index_ViewBag_Title
source: Registred maps
pt: Mapas cadastrados

# ExcluirMapaViewModel_AttributeName_NomeMapa
source: Map name
pt: Nome do mapa

# MapaController_HttpGet_Action_CalcularCusto_ViewBag_Message
source: Use this tool to calculate the lowest cost for the route
pt: Utilize esta ferramenta para calcular o menor trajeto e seu custo.

# MapaController_HttpGet_Action_CalcularCusto_ViewBag_Title
source: Calculate cost for route:
pt: Calcular custo para o trajeto:

# MapaController_HttpGet_Action_Create_ViewBag_Message
source: Use this tool to register a new map.In case it already exist will be overrided
pt: Utilize esta ferramenta para cadastrar um novo mapa. Se o mapa já existir ele sera removido e re-criado.

# MapaController_HttpGet_Action_Create_ViewBag_Title
source: Register a new map:
pt: Cadastrar novo mapa:

# MapaController_HttpGet_Action_Delete_ViewBag_Message
source: Do you really want to exclude this map?
pt: Deseja realmente excluir este mapa?

# MapaController_HttpGet_Action_Delete_ViewBag_Title
source: Delete map:
pt: Excluir mapa:

# MapaController_HttpGet_Action_List_ViewBag_Title
source: Registred maps
pt: Mapas cadastrados

# MapaController_HttpPost_Action_CalcularCusto_ViewBag_Title
source: Calculate cost for route:
pt: Calcular custo para o trajeto:

# MapaController_HttpPost_Action_Create_ViewBag_Message
source: The loading file must be specificated.
pt: O arquivo de carga precisa ser especificado.

# MapaController_HttpPost_Action_Create_ViewBag_Message2
source: The name of the map must be specificated.
pt: O nome do mapa precisa ser especificado.

# MapaController_HttpPost_Action_Create_ViewBag_Title
source: Register a new map:
pt: Cadastrar novo mapa:

# MapaController_HttpPost_Action_Delete_ViewBag_Title
source: Delete map:
pt: Excluir mapa:

# MapaViewModel_AttributeName_Arquivo
source: Filename
pt: Nome do arquivo

# MapaViewModel_AttributeName_Id
source: Code
pt: Código

# MapaViewModel_AttributeName_NomeMapa
source: Map name
pt: Nome do mapa

# SelectLanguage
source: Select your language:
pt: Selecione sua linguagem:

# SelectList_Null_Item
source: Select
pt: Selecione

# View_Layout_Cultura_Ingles
source: English
pt: Inglês

# View_Layout_Cultura_Portugues
source: Portuguese
pt: Português

# FileServices_LoadMapaFromFile_Error_Message
source: Error:
pt: Erro:

# FileServices_LoadMapaFromFile_Fail_Message
source: File not processed.
pt: Arquivo não processado.

# FileServices_LoadMapaFromFile_Success_Message
source: File processed with success.
pt: Arquivo processado com sucesso.

# MapaServices_AlterarMapa_Error_Message
source: Error:
pt: Erro:

# MapaServices_AlterarMapa_Fail2_Message
source: Map not found.
pt: Mapa não encontrado.

# MapaServices_AlterarMapa_Fail_Message
source: Error:
pt: Erro:

# MapaServices_AlterarMapa_Success_Message
source: Map updated with success.
pt: Mapa alterado com sucesso.

# MapaServices_CalcularRota_Fail2_Message
source: Error:
pt: Erro:

# MapaServices_CalcularRota_Fail_Message
source: Map not found.
pt: Mapa não encontrado.

# MapaServices_CalcularRota_Success_Message
source: Success.
pt: Sucesso.

# MapaServices_EncontrarMapaPor_Error_Message
source: Error:
pt: Erro:

# MapaServices_EncontrarMapaPor_Fail_Message
source: Map not found.
pt: Mapa não encontrado.

# MapaServices_EncontrarMapaPor_Success_Message
source: Map found.
pt: Mapa encontrado.

# MapaServices_EncontrarTodosMapas_Error_Message
source: Error:
pt: Erro:

# MapaServices_EncontrarTodosMapas_Failed_Message
source: No maps found.
pt: Nenhum mapa encontrado.

# MapaServices_EncontrarTodosMapas_Success_Message
source: Found {0} map(s)
pt: Encontrado(s) {0} mapa(s).

# MapaServices_ExcluirMapa_Error_Message
source: Error:
pt: Erro:

# MapaServices_ExcluirMapa_Fail_Message
source: Map not found.
pt: Mapa não encontrado.

# MapaServices_ExcluirMapa_Success_Message
source: Map removed with success.
pt: Mapa excluido com sucesso.

# MapaServices_InserirMapa_Error_Message
source: Error:
pt: Erro:

# MapaServices_InserirMapa_Fail_Message
source: Error:
pt: Erro:

# MapaServices_InserirMapa_Success_Message
source: Map added with success.
pt: Mapa adicionado com sucesso.

# ResultadoCustoViewModel_AttributeName_Caminho
source: Path
pt: Caminho

# ResultadoCustoViewModel_AttributeName_CustoTotal
source: Total cost
pt: Custo total

# Views_Mapa_CadastrarMapaPartialView_Button_Cadastrar
source: Register
pt: Cadastrar

# Views_Mapa_CadastrarMapaPartialView_Button_Cancelar
source: Cancel
pt: Cancelar

# Views_Mapa_CadastrarMapaPartialView_Button_Fechar
source: Close
pt: Fechar

# Views_Mapa_CalcularCustoPartialView_Button_Calcular
source: Calculate
pt: Calcular

# Views_Mapa_CalcularCustoPartialView_Button_Cancelar
source: Cancel
pt: Cancelar

# Views_Mapa_CalcularCustoPartialView_Button_Fechar
source: Close
pt: Fechar

# Views_Mapa_ExcluirMapaPartialView_Button_Cancelar
source: Cancel
pt: Cancelar

# Views_Mapa_ExcluirMapaPartialView_Button_Excluir
source: Remove
pt: Excluir

# Views_Mapa_ExcluirMapaPartialView_Button_Fechar
source: Close
pt: Fechar

# Views_Mapa_ListaMapasPartialView_Button_Novo
source: New map
pt: Novo mapa

# Views_Mapa_ResultadoCustoPartialView_Button_Fechar
source: Close
pt: Fechar

# Views_Mapa_SucessoPartialView_Button_Fechar
source: Close
pt: Fechar

# Views_Shared_Layout_WindowModal_Application_Title
source: Avenue Delivery
pt: Avenue Entregas

# Views_Shared_Layout_WindowModal_Button_Cancelar
source: Cancel
pt: Cancelar

# Views_Shared_Layout_WindowModal_Button_Fechar
source: Close
pt: Fechar

# MapaSpecification_AttributeName_NomeMapa
source: The map name must be specified.
pt: O nome do mapa precisa ser especificado.

# MapaSpecification_AttributeName_Rotas
source: The map must have routes.
pt: O mapa precisa possuir rotas.

# ProblemSpecification_AttributeName_AutonomiaVeiculo
source: The vehicle autonomy cannot be zero.
pt: A autonomia do veículo não pode ser zero.

# ProblemSpecification_AttributeName_Destino
source: The destination must be specified.
pt: Odestino deve ser especificado.

# ProblemSpecification_AttributeName_NomeMapa
source: A map name must be specified.
pt: Um nome de mapa deve ser especificado.

# ProblemSpecification_AttributeName_Origem
source: The origin must be specified.
pt: A origem deve ser especificada.

# ProblemSpecification_AttributeName_ValorCombustivel
source: The fuel value cannot be zero.
pt: O valor do combustivel não pode ser zero.

# RotaSpecification_AttributeName_Destino
source: The route must have a destination.
pt: A rota precisa possuir um destino.

# RotaSpecification_AttributeName_Origem
source: The route must have a origin.
pt: A rota precisa possuir uma origem.

# MapaController_HttpPost_Action_Find_ViewBag_Title
source: Registred maps
pt: Mapas cadastrados.

# MapaServices_EncontrarTodosMapasPor_Error_Message
source: Error:
pt: Erro:

# MapaServices_EncontrarTodosMapasPor_Fail_Message
source: Map not found.
pt: Nenhum mapa encontrado.

# MapaServices_EncontrarTodosMapasPor_Success_Message
source: Found {0} map(s)
pt: Encontrado(s) {0} mapa(s).

# Views_Mapa_ListarMapasPartialView_Button_Buscar
source: Find maps:
pt: Encontrar mapas:

# Views_Mapa_ListarMapasPartialView_Label_Buscar
source: Send
pt: Enviar
